{"_path":"/pages/aboutme","_dir":"pages","_draft":false,"_partial":false,"_locale":"","title":"Aboutme","description":"In 2016, I embarked on my academic journey in Engineering school with an ambitious passion to change lives and solve the world's problems. However, I didn't know what specific type of\nEngineering I wanted to do. It wasn't until my Freshman year's Spring semester that I found myself in my first coding class, which ignited an immediate fascination.","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In 2016, I embarked on my academic journey in Engineering school with an ambitious passion to change lives and solve the world's problems. However, I didn't know what specific type of\nEngineering I wanted to do. It wasn't until my Freshman year's Spring semester that I found myself in my first coding class, which ignited an immediate fascination."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Driven by this newfound passion, I made the decision to shift my major to Computer Science & Engineering. Over the next few years, I delved into mastering languages like Python and Java, and\nlearning the vital concepts of Software Engineering. As my college journey progressed, the challenge of starting my career began to feel overwhelming. By the end of my academic career, I faced\nthe daunting task of entering the professional world with only one internship and a modest portfolio and with the onset of the COVID pandemic further complicating my distress."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Experiencing burnout, I decided to chase one of my biggest passions, Craft Beer. Working in beer retail was an amazing experience, and it was a time where I really grew as a person. Despite\nthat this line of work was a passion of mine, I still felt unfulfilled in a way I couldn't put my finger on. It was during this time that, on a whim, I returned to programming for leisure. The\nmatured version of myself, having undergone substantial personal growth, found that the moment was a great opportunity to rekindle my love for Software Development."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Armed with newfound discipline, drive, and confidence, I reentered the world of programming. This time around, I possessed the resilience needed to navigate the challenges of job searching and\ntroubleshooting errors without succumbing to stress. Since then, I have diligently worked towards establishing myself in the Software Development field. My journey in Software Development has\nbeen a unique and transformative experience and recently I have not only learned extensively but also created projects that I never thought I could do before. My commitment to continually\nimproving myself propels me forward, and I am eager to grow in my newfound love for this work."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:pages:aboutme.md","_source":"content","_file":"pages/aboutme.md","_extension":"md"}