[{"data":1,"prerenderedAt":139},["Reactive",2],{"content-query-vOiFgqXwxa":3,"content-query-H9NxFE986y":100},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"date":10,"tags":11,"imgurl":16,"links":17,"linkimgurls":19,"body":21,"_type":95,"_id":96,"_source":97,"_file":98,"_extension":99},"/projects/mtgmetatracker","projects",false,"","MTGMetaTracker","Using data from mtggoldfish.com to create a website that tracks the popularity of decks within competitive Magic The Gathering.","2023-08-14T00:00:00.000Z",[12,13,14,15],"Full Stack","Express","MongoDB","D3.js","/M.png",[18],"https://github.com/NickGroveSE/MTGMetaTracker",[20],"/github-mark.svg",{"type":22,"children":23,"toc":92},"root",[24,32,37,42,47,75],{"type":25,"tag":26,"props":27,"children":28},"element","p",{},[29],{"type":30,"value":31},"text","For my return to Software Development, I wanted a project that was straightforward in its concept but something that exposes me to a lot of new technologies. MTGMetaTracker was ultimately a great fit since I got to work with MongoDB, Express.js, EJS, parse5, and axios for the first time while also expanding my knowledge on CSS, JavaScript, and D3.js. What MTGMetaTracker is, is a web app that fetches data from competitive events for the card game Magic The Gathering from MTGGoldfish, then storing and visualizing this data over time. I loved this idea because from being in the competitive Magic The Gathering scene, it is interesting to see how strategies rise, fall, and evolve as time goes on.",{"type":25,"tag":26,"props":33,"children":34},{},[35],{"type":30,"value":36},"My overall process for this site was Functionality first, obviously the Frontend and the Design were important, but the data would dictate what this site would become. Starting after I initialized my Express environment with a simple Frontend, I dove into working with axios and parse5 to create my Web Scraper. Axios was a pretty standard setup, but challenges came with implementing parse5, and it came down to some reading of the docs and printing of the axios response to produce some functions to traverse the html.",{"type":25,"tag":26,"props":38,"children":39},{},[40],{"type":30,"value":41},"From here it was time to set up MongoDB which went pretty well, it was just about learning to how to save the data and query. For creating my schemas I was only going to need one call Archetypes which is what the strategies or deck types are called in Magic The Gathering. Originally for this schema I started out with just storing the name, the format (a format is the style of Magic that is played in a competition, for example Vintage is a very old format where you can play cards all the way back to the 90s and Pioneer is a MTG format for more recent cards dating back to 2012), and a data array that saves a date, popularity statistic (meta), and price statistic. Later on I added more vital variables to the schema and this taught me a lot about the importance of putting a good amount of time into planning out your schemas.",{"type":25,"tag":26,"props":43,"children":44},{},[45],{"type":30,"value":46},"With all of this out of the way, I turned to the Frontend which came down to a lot of formatting of the pages and D3.js. The Frontend is the main part of this project that is still a work in progress, everything is graphing well with D3 and the buttons for each archetype are looking great (Figure 1), but currently making this Frontend pop is my big end goal, eventually looking to get to the design shown in Figure 2 with my buttons. Before I get into anything magor with the Front I can do some tweaks to it and start hosting the site because everything is pretty much ready to go, so that will be my next step.",{"type":25,"tag":48,"props":49,"children":52},"div",{"id":50,"style":51},"fig-1","display: block; max-width: 740px; margin-left: auto; margin-right: auto;",[53,55,61,62,68,69],{"type":30,"value":54},"\n    ",{"type":25,"tag":48,"props":56,"children":58},{"style":57},"display: inline; font-size: 18px; font-weight: 900; color: #42b883;",[59],{"type":30,"value":60},"Figure 1:",{"type":30,"value":54},{"type":25,"tag":48,"props":63,"children":65},{"style":64}," font-size: 14px;",[66],{"type":30,"value":67},"List of the top Archetypes. This is shown after the user selects a Format, for example in this screenshot they chose Modern.",{"type":30,"value":54},{"type":25,"tag":70,"props":71,"children":74},"img",{"src":72,"style":73},"/example-format-page.png","width: 100%; margin: 10px 0 50px 0",[],{"type":25,"tag":48,"props":76,"children":78},{"id":77,"style":51},"fig-2",[79,80,86,87],{"type":30,"value":54},{"type":25,"tag":48,"props":81,"children":83},{"style":82},"font-size: 18px; font-weight: 900; color: #42b883;",[84],{"type":30,"value":85},"Figure 2:",{"type":30,"value":54},{"type":25,"tag":70,"props":88,"children":91},{"src":89,"style":90},"/Panel-Mock-Ups.jpg","display: block; width: 60%; margin: 10px auto 50px auto;",[],{"title":7,"searchDepth":93,"depth":93,"links":94},2,[],"markdown","content:projects:mtgmetatracker.md","content","projects/mtgmetatracker.md","md",{"_path":101,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":102,"description":103,"date":104,"tags":105,"imgurl":109,"links":110,"linkimgurls":112,"body":113,"_type":95,"_id":137,"_source":97,"_file":138,"_extension":99},"/projects/wordlesolver","Wordle Solver","As a refresher project for Python, I created a local Python application that can play and solve Wordle for me.","2023-11-09T00:00:00.000Z",[106,107,108],"Python","Pandas","PyAutoGUI","/Wordle.webp",[111],"https://github.com/NickGroveSE",[20],{"type":22,"children":114,"toc":135},[115,120,125,130],{"type":25,"tag":26,"props":116,"children":117},{},[118],{"type":30,"value":119},"One weekend when I was in between finishing most of my MTGMetaTracker project and starting my work with the Vue.js, I want a quick casual project that would be engaging as I went through transition period. I had the idea since my girlfriend and I had been playing Wordle a lot at the time, what if I make a Python program that can solve Wordle. To me this felt perfect, I would get to work with some automation technology, get a refresher on a very relevant language I have not used in awhile, and it would be lightweight yet challenging.",{"type":25,"tag":26,"props":121,"children":122},{},[123],{"type":30,"value":124},"First step was to get Wordle's word data, which was simple. I found it online along with each words probability of being the word of the day. I read this csv file using Pandas and from here we set up the PyAutoGUI. This was fairly straight forward as well, just needed to figure how my program could recognize the board and the colors of the guesses. Using an image of empty my program can detect where the board is on the screen, then after each guess the program would identify what colors a guess returned by checking each square.",{"type":25,"tag":26,"props":126,"children":127},{},[128],{"type":30,"value":129},"The last step to this application was the logic behind guessing. This was the most involved step of the program, and currently I am even testing and optimizing it. The best way I found to keep track of letters was to create three global variables: a dictionary for Yellow Letters where each key is a letter and the value is the array of the positions it was found to be yellow, a five index array for Green Letters, and an array for Gray Letters. Each of these containers were custom for the letters color to make it easier on our logic. My logic for generate the best guess was to check Grays, Yellows, then Greens, and the loop would check positions 1-5 since positioning is very important for Yellows and Greens. As the program goes through these checks it whittles down my list of possible words, and then after these checks the best is index 0, because the list is sorted by its \"Occurrence\" aka probability to be the right answer.",{"type":25,"tag":26,"props":131,"children":132},{},[133],{"type":30,"value":134},"As of right now for this project its about working out any kinks with testing, and making this program faster. Python is known for great speed, so optimization is my ultimate end goal.",{"title":7,"searchDepth":93,"depth":93,"links":136},[],"content:projects:wordlesolver.md","projects/wordlesolver.md",1702088897232]