{"generatedAt":1702088897199,"generateTime":397,"contents":[{"_path":"/pages/aboutme","_dir":"pages","_draft":false,"_partial":false,"_locale":"","title":"Aboutme","description":"In 2016, I embarked on my academic journey in Engineering school with an ambitious passion to change lives and solve the world's problems. However, I didn't know what specific type of\nEngineering I wanted to do. It wasn't until my Freshman year's Spring semester that I found myself in my first coding class, which ignited an immediate fascination.","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In 2016, I embarked on my academic journey in Engineering school with an ambitious passion to change lives and solve the world's problems. However, I didn't know what specific type of\nEngineering I wanted to do. It wasn't until my Freshman year's Spring semester that I found myself in my first coding class, which ignited an immediate fascination."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Driven by this newfound passion, I made the decision to shift my major to Computer Science & Engineering. Over the next few years, I delved into mastering languages like Python and Java, and\nlearning the vital concepts of Software Engineering. As my college journey progressed, the challenge of starting my career began to feel overwhelming. By the end of my academic career, I faced\nthe daunting task of entering the professional world with only one internship and a modest portfolio and with the onset of the COVID pandemic further complicating my distress."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Experiencing burnout, I decided to chase one of my biggest passions, Craft Beer. Working in beer retail was an amazing experience, and it was a time where I really grew as a person. Despite\nthat this line of work was a passion of mine, I still felt unfulfilled in a way I couldn't put my finger on. It was during this time that, on a whim, I returned to programming for leisure. The\nmatured version of myself, having undergone substantial personal growth, found that the moment was a great opportunity to rekindle my love for Software Development."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Armed with newfound discipline, drive, and confidence, I reentered the world of programming. This time around, I possessed the resilience needed to navigate the challenges of job searching and\ntroubleshooting errors without succumbing to stress. Since then, I have diligently worked towards establishing myself in the Software Development field. My journey in Software Development has\nbeen a unique and transformative experience and recently I have not only learned extensively but also created projects that I never thought I could do before. My commitment to continually\nimproving myself propels me forward, and I am eager to grow in my newfound love for this work."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:pages:aboutme.md","_source":"content","_file":"pages/aboutme.md","_extension":"md"},{"_path":"/projects/mtgmetatracker","_dir":"projects","_draft":false,"_partial":false,"_locale":"","title":"MTGMetaTracker","description":"Using data from mtggoldfish.com to create a website that tracks the popularity of decks within competitive Magic The Gathering.","date":"2023-08-14T00:00:00.000Z","tags":["Full Stack","Express","MongoDB","D3.js"],"imgurl":"/M.png","links":["https://github.com/NickGroveSE/MTGMetaTracker"],"linkimgurls":["/github-mark.svg"],"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"For my return to Software Development, I wanted a project that was straightforward in its concept but something that exposes me to a lot of new technologies. MTGMetaTracker was ultimately a great fit since I got to work with MongoDB, Express.js, EJS, parse5, and axios for the first time while also expanding my knowledge on CSS, JavaScript, and D3.js. What MTGMetaTracker is, is a web app that fetches data from competitive events for the card game Magic The Gathering from MTGGoldfish, then storing and visualizing this data over time. I loved this idea because from being in the competitive Magic The Gathering scene, it is interesting to see how strategies rise, fall, and evolve as time goes on."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"My overall process for this site was Functionality first, obviously the Frontend and the Design were important, but the data would dictate what this site would become. Starting after I initialized my Express environment with a simple Frontend, I dove into working with axios and parse5 to create my Web Scraper. Axios was a pretty standard setup, but challenges came with implementing parse5, and it came down to some reading of the docs and printing of the axios response to produce some functions to traverse the html."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"From here it was time to set up MongoDB which went pretty well, it was just about learning to how to save the data and query. For creating my schemas I was only going to need one call Archetypes which is what the strategies or deck types are called in Magic The Gathering. Originally for this schema I started out with just storing the name, the format (a format is the style of Magic that is played in a competition, for example Vintage is a very old format where you can play cards all the way back to the 90s and Pioneer is a MTG format for more recent cards dating back to 2012), and a data array that saves a date, popularity statistic (meta), and price statistic. Later on I added more vital variables to the schema and this taught me a lot about the importance of putting a good amount of time into planning out your schemas."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"With all of this out of the way, I turned to the Frontend which came down to a lot of formatting of the pages and D3.js. The Frontend is the main part of this project that is still a work in progress, everything is graphing well with D3 and the buttons for each archetype are looking great (Figure 1), but currently making this Frontend pop is my big end goal, eventually looking to get to the design shown in Figure 2 with my buttons. Before I get into anything magor with the Front I can do some tweaks to it and start hosting the site because everything is pretty much ready to go, so that will be my next step."}]},{"type":"element","tag":"div","props":{"id":"fig-1","style":"display: block; max-width: 740px; margin-left: auto; margin-right: auto;"},"children":[{"type":"text","value":"\n    "},{"type":"element","tag":"div","props":{"style":"display: inline; font-size: 18px; font-weight: 900; color: #42b883;"},"children":[{"type":"text","value":"Figure 1:"}]},{"type":"text","value":"\n    "},{"type":"element","tag":"div","props":{"style":" font-size: 14px;"},"children":[{"type":"text","value":"List of the top Archetypes. This is shown after the user selects a Format, for example in this screenshot they chose Modern."}]},{"type":"text","value":"\n    "},{"type":"element","tag":"img","props":{"src":"/example-format-page.png","style":"width: 100%; margin: 10px 0 50px 0"},"children":[]}]},{"type":"element","tag":"div","props":{"id":"fig-2","style":"display: block; max-width: 740px; margin-left: auto; margin-right: auto;"},"children":[{"type":"text","value":"\n    "},{"type":"element","tag":"div","props":{"style":"font-size: 18px; font-weight: 900; color: #42b883;"},"children":[{"type":"text","value":"Figure 2:"}]},{"type":"text","value":"\n    "},{"type":"element","tag":"img","props":{"src":"/Panel-Mock-Ups.jpg","style":"display: block; width: 60%; margin: 10px auto 50px auto;"},"children":[]}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:projects:mtgmetatracker.md","_source":"content","_file":"projects/mtgmetatracker.md","_extension":"md"},{"_path":"/projects/scheduli","_dir":"projects","_draft":false,"_partial":false,"_locale":"","title":"Scheduli","description":"A sleek and unique scheduling app that focuses is on simplicity. My first Full Stack project using Vue and my introduction to various other frameworks.","date":"2023-12-01T00:00:00.000Z","tags":["Full Stack","Vue","Laravel","PostgreSQL","Tailwind CSS"],"imgurl":"","links":["https://github.com/NickGroveSE/Scheduli"],"linkimgurls":["/github-mark.svg"],"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"My goal for Scheduli was to create a sleek scheduling app for my first Full Stack application using Vue as my Frontend Framework and introduce myself to some new technologies. I decided on working with Laravel and PostgreSQL for the Backend to get my start in PHP and using modern, widely-used frameworks was important to me with this stack. When it came to the Frontend I wanted to explore as well with diving into Tailwind CSS and SASS, both of these feel like vital CSS tools for me being more Frontend-leaning."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Currently this project is in the beginning phases. Organizing the Relational Database, Design, and Planning my Backlog."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:projects:scheduli.md","_source":"content","_file":"projects/scheduli.md","_extension":"md"},{"_path":"/projects/urbanuncover","_dir":"projects","_draft":false,"_partial":false,"_locale":"","title":"Urban Uncover","description":"A design concept for a mobile app that aims to help people support their local businesses and non-profits.","date":"2023-10-27T00:00:00.000Z","tags":["Design","Figma"],"imgurl":"/UrbanUncover.png","links":[],"linkimgurls":[],"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I was participating in the online Hackathon CAPTURETHEWORLD, and since the theme was social good I decided to create a Mobile App that would be a way for people to support their local businesses and non-profits, with an emphasis on fighting against gentrification. My inspiration for this app was the gentrification I see everyday in the city I live, Cincinnati. In the neighborhood OTR there is a polarizing example of this on a main road Liberty Street. On the South side of the street it is primarily White, new developments, and higher cost of living and on the North side of the street it primarily African American, abandoned buildings, and homelessness. I wanted to create a platform where businesses that are owned by people of color and/or heavily affected by gentrification can prosper."}]},{"type":"element","tag":"div","props":{"id":"fig-1","style":"display: block; width: 70%; margin-left: auto; margin-right: auto;"},"children":[{"type":"text","value":"\n    "},{"type":"element","tag":"div","props":{"style":"display: inline; font-size: 18px; font-weight: 900; color: #42b883;"},"children":[{"type":"text","value":"Figure 1:"}]},{"type":"text","value":"\n    "},{"type":"element","tag":"div","props":{"style":" font-size: 14px;"},"children":[{"type":"text","value":"Figma designs"}]},{"type":"text","value":"\n    "},{"type":"element","tag":"img","props":{"src":"/urbanuncoverscreens.png","style":"display block; width: 100%; margin: 10px 0 50px 0"},"children":[]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"CAPTURETHEWORLD was very welcoming to projects with no code or low code, so I wanted to put some heavy emphasis on the Design (Figure 1). I felt like this idea really challenged me on the Design side of things, and I would love to come back to it one day. Next steps if I ever come back to this project is fully fleshing out the Design, showcase it on Behance, and maybe one day get to programming it using a native framework but it would be a large undertaking."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:projects:urbanuncover.md","_source":"content","_file":"projects/urbanuncover.md","_extension":"md"},{"_path":"/projects/wordlesolver","_dir":"projects","_draft":false,"_partial":false,"_locale":"","title":"Wordle Solver","description":"As a refresher project for Python, I created a local Python application that can play and solve Wordle for me.","date":"2023-11-09T00:00:00.000Z","tags":["Python","Pandas","PyAutoGUI"],"imgurl":"/Wordle.webp","links":["https://github.com/NickGroveSE"],"linkimgurls":["/github-mark.svg"],"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"One weekend when I was in between finishing most of my MTGMetaTracker project and starting my work with the Vue.js, I want a quick casual project that would be engaging as I went through transition period. I had the idea since my girlfriend and I had been playing Wordle a lot at the time, what if I make a Python program that can solve Wordle. To me this felt perfect, I would get to work with some automation technology, get a refresher on a very relevant language I have not used in awhile, and it would be lightweight yet challenging."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"First step was to get Wordle's word data, which was simple. I found it online along with each words probability of being the word of the day. I read this csv file using Pandas and from here we set up the PyAutoGUI. This was fairly straight forward as well, just needed to figure how my program could recognize the board and the colors of the guesses. Using an image of empty my program can detect where the board is on the screen, then after each guess the program would identify what colors a guess returned by checking each square."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The last step to this application was the logic behind guessing. This was the most involved step of the program, and currently I am even testing and optimizing it. The best way I found to keep track of letters was to create three global variables: a dictionary for Yellow Letters where each key is a letter and the value is the array of the positions it was found to be yellow, a five index array for Green Letters, and an array for Gray Letters. Each of these containers were custom for the letters color to make it easier on our logic. My logic for generate the best guess was to check Grays, Yellows, then Greens, and the loop would check positions 1-5 since positioning is very important for Yellows and Greens. As the program goes through these checks it whittles down my list of possible words, and then after these checks the best is index 0, because the list is sorted by its \"Occurrence\" aka probability to be the right answer."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"As of right now for this project its about working out any kinks with testing, and making this program faster. Python is known for great speed, so optimization is my ultimate end goal."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:projects:wordlesolver.md","_source":"content","_file":"projects/wordlesolver.md","_extension":"md"}],"navigation":[{"title":"Pages","_path":"/pages","children":[{"title":"Aboutme","_path":"/pages/aboutme"}]},{"title":"Projects","_path":"/projects","children":[{"title":"MTGMetaTracker","_path":"/projects/mtgmetatracker"},{"title":"Scheduli","_path":"/projects/scheduli"},{"title":"Urban Uncover","_path":"/projects/urbanuncover"},{"title":"Wordle Solver","_path":"/projects/wordlesolver"}]}]}