[{"data":1,"prerenderedAt":54},["Reactive",2],{"content-query-H9NxFE986y":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"date":10,"tags":11,"imgurl":15,"links":16,"linkimgurls":18,"body":20,"_type":49,"_id":50,"_source":51,"_file":52,"_extension":53},"/projects/wordlesolver","projects",false,"","Wordle Solver","As a refresher project for Python, I created a local Python application that can play and solve Wordle for me.","2023-11-09T00:00:00.000Z",[12,13,14],"Python","Pandas","PyAutoGUI","/Wordle.webp",[17],"https://github.com/NickGroveSE",[19],"/github-mark.svg",{"type":21,"children":22,"toc":46},"root",[23,31,36,41],{"type":24,"tag":25,"props":26,"children":27},"element","p",{},[28],{"type":29,"value":30},"text","One weekend when I was in between finishing most of my MTGMetaTracker project and starting my work with the Vue.js, I want a quick casual project that would be engaging as I went through transition period. I had the idea since my girlfriend and I had been playing Wordle a lot at the time, what if I make a Python program that can solve Wordle. To me this felt perfect, I would get to work with some automation technology, get a refresher on a very relevant language I have not used in awhile, and it would be lightweight yet challenging.",{"type":24,"tag":25,"props":32,"children":33},{},[34],{"type":29,"value":35},"First step was to get Wordle's word data, which was simple. I found it online along with each words probability of being the word of the day. I read this csv file using Pandas and from here we set up the PyAutoGUI. This was fairly straight forward as well, just needed to figure how my program could recognize the board and the colors of the guesses. Using an image of empty my program can detect where the board is on the screen, then after each guess the program would identify what colors a guess returned by checking each square.",{"type":24,"tag":25,"props":37,"children":38},{},[39],{"type":29,"value":40},"The last step to this application was the logic behind guessing. This was the most involved step of the program, and currently I am even testing and optimizing it. The best way I found to keep track of letters was to create three global variables: a dictionary for Yellow Letters where each key is a letter and the value is the array of the positions it was found to be yellow, a five index array for Green Letters, and an array for Gray Letters. Each of these containers were custom for the letters color to make it easier on our logic. My logic for generate the best guess was to check Grays, Yellows, then Greens, and the loop would check positions 1-5 since positioning is very important for Yellows and Greens. As the program goes through these checks it whittles down my list of possible words, and then after these checks the best is index 0, because the list is sorted by its \"Occurrence\" aka probability to be the right answer.",{"type":24,"tag":25,"props":42,"children":43},{},[44],{"type":29,"value":45},"As of right now for this project its about working out any kinks with testing, and making this program faster. Python is known for great speed, so optimization is my ultimate end goal.",{"title":7,"searchDepth":47,"depth":47,"links":48},2,[],"markdown","content:projects:wordlesolver.md","content","projects/wordlesolver.md","md",1702088897591]